# UnexpectedJoinFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoJoinFailures..::..UnexpectedJoinFailure Property
BuiltInFailures..::..AutoJoinFailures Class See Also
---
Join failure caused by editability or design option related problem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnexpectedJoinFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnexpectedJoinFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnexpectedJoinFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoJoinFailures Class
Autodesk.Revit.DB Namespace